app/views/articles/show.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 12]]
---
<p><%= @article.body %></p>
<h3>Comments (<%= @article.comments.size %>)</h3>